// noinspection JSNonASCIINames
let recipes = {
    // t5本
    "水能发电机": {
        "ingredients": [
            ["金锭", 8],
            ["红石粉", 8]
        ],
        "rarity": "史诗"
    },
    "哥布林重锤": {
        "ingredients": [
            ["钢残盾", 2],
            ["炽热的锻铁", 64],
            ["炮弹", 32]
        ],
        "price": 0,
        "region": "t5",
        "rarity": "稀有"
    },
    "哥布林号角": {
        "ingredients": [
            ["绿色水晶", 16],
            ["哥布林弯刀", 2],
            ["钢残盾", 2],
            ["钢铁", 64]
        ],
        "price": 0,
        "region": "t5",
        "rarity": "普通"
    },
    "铁折剑": {
        "ingredients": [
            ["血刃粗胚", 24],
            ["变异血液", 32],
            ["炽热的锻铁", 32],
            ["兽皮", 12],
            ["刀鞘", 16]
        ],
        "price": 0,
        "region": "t5",
        "rarity": "普通"
    },
    "哥布林疾步之靴": {
        "ingredients": [
            ["守卫者长靴", 1],
            ["哥布林肩甲", 1],
            ["飞速丸", 128],
            ["兽皮", 64]
        ],
        "price": 0,
        "region": "t5",
        "rarity": "普通"
    },
    "哥布林战旗": {
        "ingredients": [
            ["紫色水晶", 32],
            ["哥布林重锤", 2],
            ["兽皮", 128],
            ["破布", 64]
        ],
        "price": 0,
        "region": "t5",
        "rarity": "普通"
    },
    "哥布林强弩": {
        "ingredients": [
            ["破损齿轮", 16],
            ["毒液发射器", 2],
            ["魔法卷轴", 16],
            ["炮弹", 64],
            ["弹射器", 16]
        ],
        "price": 0,
        "region": "t5",
        "rarity": "普通"
    },
    "哥布林弯刀": {
        "ingredients": [
            ["血刃粗胚", 32],
            ["炽热的锻铁", 32],
            ["铁折剑", 2],
            ["兽皮", 32]
        ],
        "price": 0,
        "region": "t5",
        "rarity": "普通"
    },
    "钢残盾": {
        "ingredients": [
            ["守护核心", 32],
            ["炽热的锻铁", 48],
            ["兽皮", 32],
            ["钢铁", 16]
        ],
        "price": 0,
        "region": "t5",
        "rarity": "普通"
    },
    "诅咒魔盾": {
        "ingredients": [
            ["黄色水晶", 16],
            ["沙漠残骸", 128],
            ["虫肉", 64],
            ["浮岛基岩", 16],
            ["钢残盾", 1]
        ],
        "price": 0,
        "region": "t5",
        "rarity": "稀有"
    },
    "水之净化者": {
        "ingredients": [
            ["虫肉", 32],
            ["精灵之魂", 64]
        ],
        "price": 0,
        "region": "t5",
        "rarity": "普通"
    },
    "嗜血绣剑": {
        "ingredients": [
            ["黄色水晶", 32],
            ["极血刀", 1],
            ["哥布林弯刀", 1],
            ["炽热的锻铁", 32],
            ["游离之魂", 16]
        ],
        "price": 0,
        "region": "t5",
        "rarity": "稀有"
    },
    "无锋重剑": {
        "ingredients": [
            ["大型能量结晶", 6],
            ["野蛮之王的长刃", 1],
            ["哥布林战旗", 1],
            ["哥布林重锤", 2],
            ["哥布林弯刀", 2]
        ],
        "price": 100000,
        "region": "t5",
        "rarity": "史诗"
    },
    "国王权杖": {
        "ingredients": [
            ["绿色水晶", 32],
            ["魔法卷轴", 32],
            ["紫色水晶", 16],
            ["兽皮", 32]
        ],
        "price": 50000,
        "region": "t5",
        "rarity": "稀有"
    },
    "荣光壁垒": {
        "ingredients": [
            ["大型能量结晶", 8],
            ["冰盾", 2],
            ["哥布林号角", 1],
            ["哥布林战旗", 1],
            ["国王权杖", 1]
        ],
        "price": 50000,
        "region": "t5",
        "rarity": "史诗"
    },
    "稻草人之心": {
        "ingredients": [
            ["大型能量结晶", 6],
            ["哥布林法杖", 1],
            ["哥布林强弩", 1],
            ["干草块", 32],
            ["南瓜", 128],
            ["树杈", 64]
        ],
        "price": 50000,
        "region": "t5",
        "rarity": "史诗"
    },
    "地狱魔躯": {
        "ingredients": [
            ["大型能量结晶", 8],
            ["嗜血绣剑", 2],
            ["野蛮长盾", 1],
            ["钛金矿", 64]
        ],
        "price": 100000,
        "region": "t5",
        "rarity": "传说"
    },
    "灵魂收割者": {
        "ingredients": [
            ["大型能量结晶", 5],
            ["诅咒魔盾", 2],
            ["原初之灵", 1],
            ["冰雪镰刀", 2],
            ["游离之魂", 32]
        ],
        "price": 100000,
        "region": "t5",
        "rarity": "传说"
    },
    "水灵法杖": {
        "ingredients": [
            ["大型能量结晶", 6],
            ["水之净化者", 2],
            ["魔法卷轴", 64],
            ["镀金法杖", 1],
            ["自然天使", 1],
            ["精灵之魂", 32]
        ],
        "price": 100000,
        "region": "t5",
        "rarity": "传说"
    },
    "禁忌契约": {
        "ingredients": [
            ["大型能量结晶", 6],
            ["哥布林号角", 1],
            ["紫色水晶", 32],
            ["恶魔拐杖", 4]
        ],
        "price": 100000,
        "region": "t5",
        "rarity": "传说"
    },
// 塔本
    "镀金战锤": {
        "ingredients": [
            ["矮人王的神秘魔法", 2],
            ["一阶精铁锭", 64],
            ["二阶世界树枝干", 64],
            ["镀金短刀", 1],
            ["镀金长刀", 1],
            ["镀金长盾", 1],
            ["镀金法杖", 1]
        ],
        "price": 10000,
        "region": "塔",
        "rarity": "传说"
    },
    "矮人王的神秘魔法": {
        "ingredients": [
            ["一阶魔法水晶", 64],
            ["二阶魔力粉尘", 64]
        ],
        "region": "塔",
        "rarity": "史诗"
    },
    "护摩之杖": {
        "ingredients": [
            ["尘世之锁", 2],
            ["三阶世界树枝干", 64],
            ["三阶魔法水晶", 64],
            ["骨头", 64]
        ],
        "price": 20000,
        "region": "塔",
        "rarity": "传说"
    },
    "尘世之锁": {
        "ingredients": [
            ["二阶魔力粉尘", 64],
            ["三阶精铁锭", 64]
        ],
        "region": "塔",
        "rarity": "史诗"
    },
    "黑龙龙手": {
        "ingredients": [
            ["黑龙龙刀", 2],
            ["三阶精铁锭", 64],
            ["三阶魔法水晶", 64]
        ],
        "price": 30000,
        "region": "塔",
        "rarity": "传说"
    },
    "黑龙炎刀": {
        "ingredients": [
            ["三阶魔力粉尘", 64],
            ["二阶世界树枝干", 64],
            ["刀鞘", 64]
        ],
        "region": "塔",
        "rarity": "史诗"
    },
    "焰之礼馈": {
        "ingredients": [
            ["不灭的余烬", 12],
            ["四阶四焰铁笼", 32],
            ["猩红矿", 64]
        ],
        "region": "塔",
        "rarity": "传说"
    },
    "新炎王剑": {
        "ingredients": [
            ["不灭的余烬", 16],
            ["红莲宝石", 3],
            ["四阶囚焰铁笼", 32],
            ["四阶傀儡碎片", 32]
        ],
        "region": "塔",
        "rarity": "传说"
    },
    "囚徒的镣铐": {
        "ingredients": [
            ["四阶提偶碎片", 32],
            ["三阶精铁锭", 32],
            ["三阶魔法水晶", 32]
        ],
        "region": "塔",
        "rarity": "史诗"
    },

    // t4本
    "毒液发射器": {
        "ingredients": [
            ["毒液", 48],
            ["腐蚀法杖", 1],
            ["铁锭", 128]
        ],
        "region": "t4",
        "rarity": "稀有"
    },
    "猎枪|剧毒水银": {
        "ingredients": [
            ["毒液", 32],
            ["水银", 32],
            ["树杈", 32],
            ["铁锭", 64]
        ],
        "region": "t4",
        "rarity": "普通"
    },
    "剧毒净化者": {
        "ingredients": [
            ["腐蚀法杖", 2],
            ["净化石", 16],
            ["防腐剂", 16],
            ["腐化水晶", 16],
            ["中型能量结晶", 1]
        ],
        "region": "t4",
        "rarity": "史诗"
    },
    "剧毒剑盾": {
        "ingredients": [
            ["毒液发射器", 2],
            ["防腐剂", 8],
            ["腐蚀液体", 12],
            ["中型能量结晶", 1]
        ],
        "region": "t4",
        "rarity": "史诗"
    },
    "腐蚀熊刀": {
        "ingredients": [
            ["猎枪|剧毒水银", 2],
            ["腐化水晶", 12],
            ["腐蚀液体", 8],
            ["中型能量结晶", 1]
        ],
        "region": "t4",
        "rarity": "史诗"
    },
    "天使守望者": {
        "ingredients": [
            ["剧毒净化者", 3],
            ["净化石", 64],
            ["大型能量结晶", 1]
        ],
        "price": 5000,
        "region": "t4",
        "rarity": "传说"
    },
    "远古净化者之灵": {
        "ingredients": [
            ["净化之灵", 1],
            ["腐蚀钢", 256],
            ["剧毒净化者", 7],
            ["嗜血宝石", 7],
            ["月光宝石", 7],
            ["无尽宝石", 7]
        ],
        "price": 100000,
        "region": "t4",
        "rarity": "传说"
    },
    "腐化喷火器": {
        "ingredients": [
            ["剧毒剑盾", 2],
            ["毒液发射器", 3],
            ["腐蚀钢", 16],
            ["大型能量结晶", 2]
        ],
        "price": 5000,
        "region": "t4",
        "rarity": "传说"
    },
    "恶魔契约": {
        "ingredients": [
            ["猎枪亡灵杀手", 2], // 名称“猎枪忙灵杀手”可能为笔误，但按图片原文保留
            ["恶魔拐杖", 3],
            ["腐蚀钢", 32],
            ["恶魔之泉", 128],
            ["瓶中恶魔", 128],
            ["大型能量结晶", 3]
        ],
        "price": 10000,
        "region": "t4",
        "rarity": "传说"
    },
    "短斧|屠夫": { // 名称中的|保留
        "ingredients": [
            ["腐蚀熊刀", 2],
            ["恶魔拐杖", 3],
            ["净化石", 32],
            ["腐蚀钢", 32],
            ["大型能量结晶", 1]
        ],
        "price": 5000,
        "region": "t4",
        "rarity": "传说"
    },
    "腐化巨盾": {
        "ingredients": [
            ["剧毒剑盾", 2],
            ["恶魔拐杖", 1],
            ["腐蚀钢", 16],
            ["防腐剂", 32],
            ["大型能量结晶", 1]
        ],
        "price": 5000,
        "region": "t4",
        "rarity": "传说"
    },
    "短斧|圣光": {
        "ingredients": [
            ["腐蚀能力", 8],
            ["瓶中恶魔", 64],
            ["恶魔之泉", 64],
            ["腐蚀钢", 32],
            ["大型能量结晶", 4]
        ],
        "price": 10000,
        "region": "t4",
        "rarity": "传说"
    },

    // a2本
    "寒霜操纵者": {
        "ingredients": [
            ["闪电核心", 128],
            ["寒霜核心", 64],
            ["机械核心", 16],
            ["电爆盾", 4]
        ],
        "region": "a2",
        "rarity": "史诗"
    },
    "血液亵渎者": {
        "ingredients": [
            ["闪电核心", 128],
            ["血液操纵者", 5],
            ["混沌核心", 32],
            ["治疗仪", 2]
        ],
        "region": "a2",
        "rarity": "史诗"
    },
    "堡垒制造机": {
        "ingredients": [
            ["闪电核心", 64],
            ["机械核心", 16],
            ["混沌核心", 32],
            ["零件", 32],
            ["铁块", 32]
        ],
        "region": "a2",
        "rarity": "史诗"
    },
    "佐拉的机械科技头盔": {
        "ingredients": [
            ["智械核心", 1],
            ["重氢", 32],
            ["机械核心", 64]
        ],
        "price": 10000,
        "region": "a2",
        "rarity": "传说"
    },
    "机械臂": {
        "ingredients": [
            ["重氢", 32],
            ["钛金矿", 48],
            ["机械核心", 64],
            ["血液亵渎者", 3],
            ["零件", 64]
        ],
        "price": 5000,
        "region": "a2",
        "rarity": "传说"
    },
    "混沌枪": {
        "ingredients": [
            ["混沌核心", 32],
            ["钛金矿", 16],
            ["重氢", 8],
            ["激光发射器", 5]
        ],
        "region": "a2",
        "rarity": "史诗"
    },
    "等离子炮": {
        "ingredients": [
            ["重氢", 32],
            ["钛金矿", 32],
            ["机械核心", 64],
            ["混沌枪", 3],
            ["零件", 56]
        ],
        "price": 5000,
        "region": "a2",
        "rarity": "传说"
    },

    // a1本
    "云杖": {
        "ingredients": [
            ["铁锭", 64],
            ["云朵", 32],
            ["云矿", 32],
            ["奇异木", 16]
        ],
        "region": "a1",
        "rarity": "普通"
    },
    "彩虹利刃": {
        "ingredients": [
            ["五彩精灵", 1],
            ["彩虹碎片", 24],
            ["铅块", 64]
        ],
        "region": "a1",
        "rarity": "稀有"
    },
    "云盾": {
        "ingredients": [
            ["铁锭", 64],
            ["云朵", 64],
            ["云矿", 32]
        ],
        "region": "a1",
        "rarity": "普通"
    },
    "五彩精灵": {
        "ingredients": [
            ["云盾", 1],
            ["天使守护者", 1],
            ["彩虹碎片", 24],
            ["铅块", 64]
        ],
        "region": "a1",
        "rarity": "稀有"
    },
    "奇异钢盾": {
        "ingredients": [
            ["猩红矿", 48],
            ["军团圣盾", 1],
            ["云盾", 1],
            ["奇异木", 32]
        ],
        "region": "a1",
        "rarity": "史诗"
    },
    "魔力枪": {
        "ingredients": [
            ["五彩精灵", 1],
            ["魔法之书", 2],
            ["恐惧之眼", 2],
            ["猩红矿", 24],
            ["魔矿", 24]
        ],
        "region": "a1",
        "rarity": "史诗"
    },
    "赤霄": {
        "ingredients": [
            ["圣石", 12],
            ["魔法之书", 2],
            ["妖刀红月", 1],
            ["彩虹利刃", 1],
            ["猩红矿", 64]
        ],
        "price": 1000, // 1000M点
        "region": "a1",
        "rarity": "传说"
    },
    "萨满": {
        "ingredients": [
            ["圣石", 8],
            ["精灵守护者", 1],
            ["魔力枪", 1],
            ["魔法之书", 2],
            ["奇异术", 32],
            ["魔矿", 32]
        ],
        "price": 1000, // 1000H点
        "region": "a1",
        "rarity": "传说"
    },
    "圣耀": {
        "ingredients": [
            ["圣石", 20],
            ["冰盾", 1],
            ["冰雪镰刀", 1],
            ["奇异钢盾", 1],
            ["魔力枪", 1],
            ["猩红矿", 32],
            ["魔矿", 32]
        ],
        "price": 1000, // 1000M点
        "region": "a1",
        "rarity": "传说"
    },
    "邪恶魔祛靴": {
        "ingredients": [
            ["魔矿", 32],
            ["奇异木", 32],
            ["钢块", 128]
        ],
        "price": 1000, // 1000H点
        "region": "a1",
        "rarity": "史诗"
    },
    "猩红护腿": {
        "ingredients": [
            ["猩红矿", 32],
            ["奇异木", 32],
            ["铅块", 128]
        ],
        "price": 1000, // 1000H点
        "region": "a1",
        "rarity": "史诗"
    },
    "圣石胸甲": {
        "ingredients": [
            ["圣石", 20],
            ["蛮族之王的战甲", 2],
            ["武士胸甲", 3],
            ["云矿", 64]
        ],
        "price": 5000, // 5000H点
        "region": "a1",
        "rarity": "传说"
    },
    "魔法之书": {
        "ingredients": [
            ["钢块", 64],
            ["魔矿", 16],
            ["云杖", 1]
        ],
        "region": "a1",
        "rarity": "稀有"
    },
    "猩红镐": {
        "ingredients": [
            ["石镐(崭新)", 1],
            ["奇异木", 25],
            ["猩红矿", 20],
            ["铅块", 120],
            ["钢块", 120]
        ],
        "region": "a1",
        "rarity": "史诗"
    },
    "圣石镐": {
        "ingredients": [
            ["猩红镐", 1],
            ["云镐", 2],
            ["奇异木", 4],
            ["彩虹碎片", 8],
            ["圣石", 16]
        ],
        "price": 10000,
        "region": "a1",
        "rarity": "传说"
    },

    // 空岛矿区
    "精制陨石镐": {
        "ingredients": [
            ["云矿", 32],
            ["铅块", 128],
            ["陨铁矿", 32],
            ["精制铁镐", 3],
            ["浮岛基岩", 16],
            ["中型能量结晶", 1]
        ],
        "region": "空岛",
        "rarity": "史诗"
    },
    "隐秘之镐": {
        "ingredients": [
            ["陨铁矿", 64],
            ["钢块", 128],
            ["秘银矿", 64],
            ["钛金矿", 64],
            ["森林之镐", 5], // 名称中的“搞”可能为“镐”的笔误
            ["效率之镐", 3], // 名称中的“搞”可能为“镐”的笔误
            ["浮岛基岩", 16], // 名称“悍鸟基岩”可能为笔误，但按图片原文保留
            ["大型能量结晶", 1]
        ],
        "region": "空岛",
        "rarity": "史诗"
    },
    "隐秘陨石镐": {
        "ingredients": [
            ["隐秘之镐", 1],
            ["精制陨石镐", 2],
            ["云镐", 3]
        ],
        "price": 20000, // H点
        "region": "空岛",
        "rarity": "传说"
    },
    "哥布林弓": {
        "ingredients": [
            ["钯金矿", 64], // 名称“把金矿”可能为笔误，但按图片原文保留
            ["浮岛基岩", 16],
            ["金块", 16],
            ["叶绿矿", 64]
        ],
        "region": "空岛",
        "rarity": "史诗"
    },
    "哥布林法杖": {
        "ingredients": [
            ["陨铁矿", 96],
            ["秘银矿", 96],
            ["铅块", 128],
            ["镀金法杖", 1]
        ],
        "region": "空岛",
        "rarity": "史诗"
    },
    "发光的金戒指": {
        "ingredients": [
            ["金块", 64],
            ["交易石", 128], // 名称“交易石”可能为笔误，但按图片原文保留
            ["钯金矿", 128],
            ["大型能量结晶", 2]
        ],
        "price": 20000, // H点
        "region": "空岛",
        "rarity": "传说"
    },
    "猎枪|亡灵杀手": {
        "ingredients": [
            ["魔力枪", 1],
            ["魔法之书", 1],
            ["猎枪|剧毒水银", 3],
            ["钛金矿", 64],
            ["钢块", 128]
        ],
        "region": "空岛",
        "rarity": "史诗"
    },

    // t3本
    "影舞伞": {
        "ingredients": [
            ["破布", 32],
            ["贤者之石", 5]
        ],
        "region": "t3",
        "rarity": "稀有"
    },
    "饮血剑": {
        "ingredients": [
            ["刀鞘", 32],
            ["贤者之石", 5],
            ["凝血素", 5],
            ["大太刀", 2]
        ],
        "region": "t3",
        "rarity": "稀有"
    },
    "恐惧之眼": {
        "ingredients": [
            ["钉子", 32],
            ["贤者之石", 3],
            ["凝血素", 5],
            ["利刃白鞘", 2]
        ],
        "region": "t3",
        "rarity": "史诗"
    },
    "千鹤村正": {
        "ingredients": [
            ["刀鞘", 64],
            ["耀魂", 5],
            ["贤者之石", 5],
            ["饮血剑", 1]
        ],
        "region": "t3",
        "rarity": "史诗"
    },
    "妖刀红月": {
        "ingredients": [
            ["弹射器", 16],
            ["钢铁", 64],
            ["钉子", 32],
            ["影舞伞", 1]
        ],
        "region": "t3",
        "rarity": "史诗"
    },
    "白狐": {
        "ingredients": [
            ["凝血素", 32],
            ["贤者之石", 32],
            ["千鹤村正", 1]
        ],
        "price": 1000,
        "region": "t3",
        "rarity": "传说"
    },
    "结月付丧": {
        "ingredients": [
            ["钉子", 64],
            ["耀魂", 32],
            ["弹射器", 16],
            ["妖刀红月", 1]
        ],
        "price": 1000,
        "region": "t3",
        "rarity": "传说"
    },
    "远古龙之怒": {
        "ingredients": [
            ["龙刃", 1],
            ["迅捷宝石", 7],
            ["千鹤村正", 7],
            ["妖刀红月", 7],
            ["利刃白鞘", 77],
            ["大太刀", 77],
            ["钢铁", 256]
        ],
        "price": 100000,
        "region": "t3",
        "rarity": "传说"
    },
    "治愈禁区": {
        "ingredients": [
            ["钉子", 64],
            ["耀魂", 30],
            ["贤者之石", 30],
            ["恢复型面包", 256]
        ],
        "region": "t3",
        "rarity": "史诗"
    },

    // t3.5本
    "樱|圣水": {
        "ingredients": [
            ["樱之召唤", 3],
            ["樱之因子", 24],
            ["叶绿矿", 64],
            ["钯金矿", 128],
            ["利刃白鞘", 32],
            ["大型能量结晶", 5]
        ],
        "price": 20000,
        "region": "t3.5",
        "rarity": "传说"
    },
    "樱|圣盾": {
        "ingredients": [
            ["冰盾", 1],
            ["樱之因子", 24],
            ["渔获", 2],
            ["钛金矿", 64],
            ["秘银矿", 128],
            ["大型能量结晶", 5]
        ],
        "price": 20000,
        "region": "t3.5",
        "rarity": "传说"
    },
    "渔获": {
        "ingredients": [
            ["樱木棍", 16],
            ["绿石", 128],
            ["贤者之石", 32],
            ["魔法泉水", 32]
        ],
        "region": "t3.5",
        "rarity": "史诗"
    },
    "樱|圣剑": {
        "ingredients": [
            ["白狐", 1],
            ["樱之因子", 24],
            ["黑樱枪", 2],
            ["技巧宝石", 1],
            ["钛金矿", 64],
            ["大型能量结晶", 5]
        ],
        "price": 20000,
        "region": "t3.5",
        "rarity": "传说"
    },
    "黑缨枪": {
        "ingredients": [
            ["樱木棍", 16],
            ["樱花粉", 64],
            ["耀魂", 32],
            ["凝血素", 32]
        ],
        "region": "t3.5",
        "rarity": "史诗"
    },
    "樱|契约": {
        "ingredients": [
            ["樱之召唤", 3],
            ["樱之因子", 24],
            ["技巧宝石", 1],
            ["金块", 16],
            ["钻石块", 16],
            ["陨铁矿", 64],
            ["大型能量结晶", 5]
        ],
        "price": 20000,
        "region": "t3.5",
        "rarity": "传说"
    },
    "樱花木屐": {
        "ingredients": [
            ["樱之因子", 32],
            ["樱木棍", 32],
            ["樱花粉", 32]
        ],
        "price": 5000,
        "region": "t3.5",
        "rarity": "史诗"
    },
    "樱之召唤": {
        "ingredients": [
            ["樱木棍", 16],
            ["绿石", 128],
            ["弹射器", 32],
            ["瓶中恶魔", 16]
        ],
        "region": "t3.5",
        "rarity": "史诗"
    },

    // t2本
    "镀金短刀": {
        "ingredients": [
            ["粗制骨刀", 2],
            ["变异血液", 12]
        ],
        "region": "t2",
        "rarity": "史诗"
    },
    "镀金长刃": {
        "ingredients": [
            ["金锭", 32],
            ["镀金短刀", 1],
            ["精制骨刀", 1]
        ],
        "region": "t2",
        "rarity": "史诗"
    },
    "生命之泉": {
        "ingredients": [
            ["守护核心", 6],
            ["胶水", 32],
            ["原始守护者", 2]
        ],
        "region": "t2",
        "rarity": "稀有"
    },
    "血液操纵者": {
        "ingredients": [
            ["生命之泉", 2],
            ["变异血液", 6],
            ["守护核心", 6]
        ],
        "region": "t2",
        "rarity": "史诗"
    },
    "天使守护者": {
        "ingredients": [
            ["守护核心", 4],
            ["树杈", 8],
            ["原始守护者", 1]
        ],
        "region": "t2",
        "rarity": "稀有"
    },
    "精灵守护者": {
        "ingredients": [
            ["守护核心", 20],
            ["血液操纵者", 2],
            ["天使守护者", 2]
        ],
        "price": 500,
        "region": "t2",
        "rarity": "传说"
    },
    "汲血刀": {
        "ingredients": [
            ["血液操纵者", 1],
            ["镀金长刃", 1],
            ["变异血液", 10]
        ],
        "price": 500,
        "region": "t2",
        "rarity": "传说"
    },
    "远古守卫护腕": {
        "ingredients": [
            ["远古守卫者之剑", 1],
            ["守卫者长剑|纯正", 1],
            ["守卫者长剑|刺客", 1],
            ["守卫者长剑|猎手", 1],
            ["守卫者长剑", 128]
        ],
        "price": 100000,
        "region": "t2",
        "rarity": "传说"
    },
    "守卫者长剑|刺客": {
        "ingredients": [
            ["守卫者长剑", 5],
            ["冰雪镰刀", 2],
            ["守护核心", 64],
            ["腐化水晶", 64],
            ["大型能量结晶", 4]
        ],
        "price": 2000,
        "region": "t2",
        "rarity": "传说"
    },
    "守卫者长剑|纯正": {
        "ingredients": [
            ["守卫者长剑", 5],
            ["冰雪镰刀", 1],
            ["白狐", 1],
            ["守护核心", 64],
            ["腐蚀液体", 56],
            ["大型能量结晶", 5]
        ],
        "price": 2000,
        "region": "t2",
        "rarity": "传说"
    },
    "守卫者长剑|猎手": {
        "ingredients": [
            ["守卫者长剑", 5],
            ["冰雪镰刀", 2],
            ["守护核心", 64],
            ["腐蚀钢", 16],
            ["大型能量结晶", 4]
        ],
        "price": 2000,
        "region": "t2",
        "rarity": "传说"
    },
    "雪精灵": {
        "ingredients": [
            ["钉子", 64],
            ["骨头", 64],
            ["零件", 30],
            ["铁锭", 128],
            ["镀金短刀", 1],
            ["天使守护者", 2]
        ],
        "region": "t2.5",
        "rarity": "史诗"
    },
    "短弯刀": {
        "ingredients": [
            ["胶水", 128],
            ["零件", 32],
            ["粗制骨刀", 5],
            ["铁锭", 128],
            ["镀金短刀", 1],
            ["汲血刀", 1]
        ],
        "region": "t2.5",
        "rarity": "史诗"
    },

    // t1本
    "原始守护者": {
        "ingredients": [
            ["圆石", 64],
            ["树杈", 4],
            ["羽毛", 6]
        ],
        "region": "t1",
        "rarity": "普通"
    },
    "粗制骨刀": {
        "ingredients": [
            ["骨头", 12],
            ["树杈", 8],
            ["带刺骨头", 1]
        ],
        "region": "t1",
        "rarity": "普通"
    },
    "带刺骨头": {
        "ingredients": [
            ["骨头", 4],
            ["羽毛", 8],
            ["胶水", 4]
        ],
        "region": "t1",
        "rarity": "普通"
    },
    "多兰之盾": {
        "ingredients": [
            ["骨头", 16],
            ["胶水", 8],
            ["带刺骨头", 1]
        ],
        "region": "t1",
        "rarity": "稀有"
    },
    "远古野兽契约": {
        "ingredients": [
            ["霍斯契约", 1],
            ["原初之灵", 10],
            ["原始守护者", 128]
        ],
        "price": 100000,
        "region": "t1",
        "rarity": "传说"
    },
    "效率之镐": {
        "ingredients": [
            ["钻石镐(崭新)", 1],
            ["羽毛", 64],
            ["胶水", 64],
            ["钻石", 32]
        ],
        "region": "t1",
        "rarity": "史诗"
    },
    "放逐之刃": {
        "ingredients": [
            ["镀金短刀", 2],
            ["钉子", 64],
            ["放逐之魂", 32],
            ["中型能量结晶", 4]
        ],
        "region": "t1",
        "rarity": "史诗"
    },
    "自然天使": {
        "ingredients": [
            ["钉子", 64],
            ["树杈", 64],
            ["攀爬之魂", 16],
            ["潜行之魂", 16],
            ["生命之泉", 2],
            ["中型能量结晶", 3]
        ],
        "region": "t1",
        "rarity": "史诗"
    },
    "野蛮之王的长刃": {
        "ingredients": [
            ["放逐之刃", 3],
            ["自然天使", 1],
            ["大型能量结晶", 2]
        ],
        "price": 10000,
        "region": "t1",
        "rarity": "传说"
    },
    "野蛮长盾": {
        "ingredients": [
            ["军团圣盾", 2],
            ["自然天使", 2],
            ["钢铁", 128],
            ["潜行之魂", 16],
            ["放逐之魂", 16],
            ["攀爬之魂", 16],
            ["大型能量结晶", 1]
        ],
        "price": 1000,
        "region": "t1",
        "rarity": "史诗"
    },
};

// 基础物品定义（没有配方但有地区和稀有度属性）
const baseItems = {
    "金锭": { region: "普通矿", rarity: "普通" },
    "红石粉": { region: "普通矿", rarity: "普通" },
    "血刃粗胚": { region: "t5", rarity: "稀有" },
    "炽热的锻铁": { region: "t5", rarity: "普通" },
    "兽皮": { region: "t5", rarity: "普通" },
    "守卫者长靴": { region: "t2", rarity: "稀有" },
    "哥布林肩甲": { region: "t5", rarity: "稀有" },
    "飞速丸": { region: "无", rarity: "稀有" },
    "紫色水晶": { region: "t5", rarity: "史诗" },
    "破损齿轮": { region: "t5", rarity: "传说" },
    "魔法卷轴": { region: "t5", rarity: "史诗" },
    "炮弹": { region: "t5", rarity: "稀有" },
    "黄色水晶": { region: "t5", rarity: "史诗" },
    "沙漠残骸": { region: "t5", rarity: "普通" },
    "虫肉": { region: "t5", rarity: "普通" },
    "浮岛基岩": { region: "空岛矿", rarity: "普通" },
    "精灵之魂": { region: "t5", rarity: "稀有" },
    "游离之魂": { region: "t5", rarity: "史诗" },
    "大型能量结晶": { region: "无", rarity: "传说" },
    "干草块": { region: "t1", rarity: "普通" },//
    "南瓜": { region: "t1", rarity: "普通" },//
    "钛金矿": { region: "空岛矿", rarity: "史诗" },
    "恶魔拐杖": { region: "t5", rarity: "史诗" },
    "绿色水晶": { region: "t5", rarity: "史诗" },

    "一阶精铁锭": { region: "塔", rarity: "普通" },
    "二阶世界树枝干": { region: "塔", rarity: "普通" },
    "一阶魔法水晶": { region: "塔", rarity: "普通" },
    "二阶魔力粉尘": { region: "塔", rarity: "普通" },
    "三阶世界树枝干": { region: "塔", rarity: "普通" },
    "三阶魔法水晶": { region: "塔", rarity: "普通" },
    "三阶精铁锭": { region: "塔", rarity: "普通" },
    "三阶魔力粉尘": { region: "塔", rarity: "普通" },
    "不灭的余烬": { region: "塔", rarity: "史诗" },
    "四阶四焰铁笼": { region: "塔", rarity: "稀有" },
    "猩红矿": { region: "a1", rarity: "普通" },//
    "红莲宝石": { region: "无", rarity: "传说" },//
    "四阶囚焰铁笼": { region: "塔", rarity: "稀有" },
    "四阶傀儡碎片": { region: "塔", rarity: "稀有" },
    "四阶提偶碎片": { region: "塔", rarity: "稀有" },

    "毒液": { region: "t4", rarity: "普通" },
    "腐蚀法杖": { region: "t4", rarity: "普通" },
    "铁锭": { region: "普通矿", rarity: "普通" },
    "水银": { region: "t4", rarity: "普通" },
    "净化石": { region: "t4", rarity: "史诗" },
    "防腐剂": { region: "t4", rarity: "稀有" },
    "腐化水晶": { region: "t4", rarity: "稀有" },
    "中型能量结晶": { region: "无", rarity: "史诗" }, //
    "腐蚀液体": { region: "t4", rarity: "稀有" },
    "净化之灵": { region: "t4", rarity: "史诗" },
    "腐蚀钢": { region: "t4", rarity: "传说" },
    "嗜血宝石": { region: "无", rarity: "史诗" },
    "月光宝石": { region: "无", rarity: "史诗" },
    "无尽宝石": { region: "无", rarity: "史诗" },
    "恶魔之泉": { region: "t4", rarity: "稀有" },
    "瓶中恶魔": { region: "t4", rarity: "稀有" },

    "闪电核心": { region: "a2", rarity: "普通" },
    "寒霜核心": { region: "a2", rarity: "稀有" },
    "机械核心": { region: "a2", rarity: "史诗" },
    "电爆盾": { region: "a2", rarity: "稀有" },
    "混沌核心": { region: "a2", rarity: "史诗" },
    "治疗仪": { region: "a2", rarity: "稀有" },
    "铁块": { region: "普通矿", rarity: "普通" },
    "智械核心": { region: "a2", rarity: "传说" },
    "重氢": { region: "a2", rarity: "传说" },
    "激光发射器": { region: "a2", rarity: "稀有" },

    "云朵": { region: "a1", rarity: "普通" },
    "云矿": { region: "a1", rarity: "稀有" },
    "奇异术": { region: "a1", rarity: "史诗" },
    "彩虹碎片": { region: "a1", rarity: "稀有" },
    "铅块": { region: "a1", rarity: "稀有" },
    "奇异木": { region: "a1", rarity: "普通" },
    "魔矿": { region: "a1", rarity: "史诗" },
    "圣石": { region: "a1", rarity: "传说" },
    "钢块": { region: "a1", rarity: "稀有" },
    "武士胸甲": { region: "t2", rarity: "稀有" },
    "石镐(崭新)": { region: "无", rarity: "普通" },

    "陨铁矿": { region: "空岛", rarity: "史诗" },
    "精制铁镐": { region: "t4", rarity: "史诗" },
    "秘银矿": { region: "空岛", rarity: "传说" },
    "森林之镐": { region: "t1", rarity: "稀有" },
    "钯金矿": { region: "空岛", rarity: "史诗" },
    "金块": { region: "普通矿", rarity: "稀有" },
    "叶绿矿": { region: "空岛", rarity: "史诗" },
    "交易石": { region: "普通矿", rarity: "史诗" },

    "破布": { region: "t3", rarity: "普通" },
    "贤者之石": { region: "t3", rarity: "稀有" },
    "刀鞘": { region: "t3", rarity: "普通" },
    "凝血素": { region: "t3", rarity: "稀有" },
    "大太刀": { region: "t3", rarity: "普通" },
    "钉子": { region: "t3", rarity: "普通" },
    "利刃白鞘": { region: "t3", rarity: "普通" },
    "耀魂": { region: "t3", rarity: "稀有" },
    "弹射器": { region: "t3", rarity: "稀有" },
    "钢铁": { region: "t3", rarity: "普通" },
    "龙刃": { region: "t3", rarity: "史诗" },
    "迅捷宝石": { region: "t3", rarity: "史诗" },
    "恢复型面包": { region: "无", rarity: "普通" },

    "樱之因子": { region: "t3.5", rarity: "传说" },
    "樱木棍": { region: "t3.5", rarity: "史诗" },
    "绿石": { region: "t3.5", rarity: "稀有" },
    "魔法泉水": { region: "t3.5", rarity: "稀有" },
    "技巧宝石": { region: "t3.5", rarity: "史诗" },
    "樱花粉": { region: "t3.5", rarity: "史诗" },
    "钻石块": { region: "普通矿", rarity: "普通" },

    "远古守卫者之剑": { region: "t2", rarity: "史诗" },
    "守卫者长剑": { region: "t2", rarity: "普通" },
    "变异血液": { region: "t2", rarity: "稀有" },
    "守护核心": { region: "t2", rarity: "稀有" },
    "冰盾": { region: "t2.5", rarity: "传说" },
    "冰雪镰刀": { region: "t2.5", rarity: "传说" },
    "零件": { region: "t2.5", rarity: "史诗" },

    // t1本基础物品
    "圆石": { region: "普通矿", rarity: "普通" },
    "羽毛": { region: "t1", rarity: "普通" },
    "胶水": { region: "t1", rarity: "普通" },
    "骨头": { region: "t1", rarity: "普通" },
    "树杈": { region: "t1", rarity: "普通" },
    "霍斯契约": { region: "t1", rarity: "史诗" },
    "原初之灵": { region: "t1", rarity: "史诗" },
    "钻石镐(崭新)": { region: "无", rarity: "普通" },
    "钻石": { region: "普通矿", rarity: "普通" },
    "放逐之魂": { region: "t1", rarity: "史诗" },
    "攀爬之魂": { region: "t1", rarity: "史诗" },
    "潜行之魂": { region: "t1", rarity: "史诗" },

    "镀金法杖": { region: "商店", rarity: "史诗" },
    "镀金长盾": { region: "商店", rarity: "史诗" },
    "哥布林匕首": { region: "商店", rarity: "稀有" },

};

// 将基础物品合并到recipes中，但不覆盖已有配方
Object.keys(baseItems).forEach(key => {
    if (!recipes[key]) {
        recipes[key] = baseItems[key];
    }
});